# Agregación de datos por categoría

In [2]:
import numpy as np
import pandas as pd

In [3]:
gender = ["Male","Female"]
income = ["Poor","Middle Class", "Rich"]

In [4]:
n=500

gender_data = []
income_data = []

for i in range(0,n):
    gender_data.append(np.random.choice(gender))
    income_data.append(np.random.choice(income))

In [5]:
income_data[1:10]

['Middle Class',
 'Middle Class',
 'Rich',
 'Middle Class',
 'Rich',
 'Rich',
 'Middle Class',
 'Poor',
 'Middle Class']

In [6]:
gender_data[1:10]

['Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Male']

In [7]:
#N(m,s) -> m+s*z
height = 160 + 30 * np.random.randn(n)
weight = 65 + 25 * np.random.randn(n)
age = 30 + 12 * np.random.randn(n)
income = 18000 + 3500 * np.random.randn(n)

In [8]:
data = pd.DataFrame(
{
    "Gender": gender_data,
    "Economic Status": income_data,
    "Height": height,
    "Weight": weight,
    "Age": age,
    "Income": income
}
)

In [9]:
data.head()

   Gender Economic Status      Height      Weight        Age        Income
0    Male    Middle Class  117.781557   97.834272  14.938084  17920.280966
1  Female    Middle Class  197.562254   77.290039  52.582434  21277.683092
2    Male    Middle Class  169.318207   92.244197  27.625656  15468.020544
3    Male            Rich  153.592959   70.243792  41.525063  16939.898258
4    Male    Middle Class  222.186635  119.904162  10.787840  18540.679655

Para hacer una agraupación de datos al mismo DF hay que hacerle un groupBy

In [10]:
groped_gender = data.groupby("Gender")

In [11]:
groped_gender.groups

{'Female': Int64Index([  1,   5,   7,  12,  14,  16,  17,  19,  20,  21,
             ...
             484, 486, 489, 490, 492, 494, 496, 497, 498, 499],
            dtype='int64', length=254),
 'Male': Int64Index([  0,   2,   3,   4,   6,   8,   9,  10,  11,  13,
             ...
             471, 476, 482, 483, 485, 487, 488, 491, 493, 495],
            dtype='int64', length=246)}

In [12]:
for names, groups in groped_gender:
    print(names)
    print(groups)

Female
     Gender Economic Status      Height      Weight        Age        Income
1    Female    Middle Class  197.562254   77.290039  52.582434  21277.683092
5    Female            Rich  167.512011   48.817092  45.698347  19918.387697
7    Female    Middle Class  163.907926   62.567780  39.643636  17031.478808
12   Female    Middle Class  145.003603   85.634519 -10.617174  20183.243171
14   Female    Middle Class  170.160167   95.531053   8.194501  18887.120561
..      ...             ...         ...         ...        ...           ...
494  Female            Poor  119.231952  113.363784  57.312663  13448.948926
496  Female            Poor  187.528037   82.404516  18.529947  22187.561070
497  Female    Middle Class  178.123925   86.843404  40.600850  20907.746694
498  Female            Poor  179.871374   72.779608  38.477364  23164.137941
499  Female    Middle Class  143.008219   45.425839  40.433941  11414.287674

[254 rows x 6 columns]
Male
    Gender Economic Status      Height      Weight        Age        Income
0     Male    Middle Class  117.781557   97.834272  14.938084  17920.280966
2     Male    Middle Class  169.318207   92.244197  27.625656  15468.020544
3     Male            Rich  153.592959   70.243792  41.525063  16939.898258
4     Male    Middle Class  222.186635  119.904162  10.787840  18540.679655
6     Male            Rich  122.433934   96.429349  38.456869  12483.297406
..     ...             ...         ...         ...        ...           ...
487   Male    Middle Class  249.322550   61.017801  48.591057  12351.917534
488   Male            Rich  177.819679   73.980196  40.817707  19350.811621
491   Male    Middle Class  107.979852   73.205669  30.613716  21225.673953
493   Male            Rich  177.399772   80.431485  24.696225  20755.318312
495   Male    Middle Class  152.610146   85.586056  46.525653  21819.493822

[246 rows x 6 columns]

In [13]:
groped_gender.get_group("Female")

     Gender Economic Status      Height      Weight        Age        Income
1    Female    Middle Class  197.562254   77.290039  52.582434  21277.683092
5    Female            Rich  167.512011   48.817092  45.698347  19918.387697
7    Female    Middle Class  163.907926   62.567780  39.643636  17031.478808
12   Female    Middle Class  145.003603   85.634519 -10.617174  20183.243171
14   Female    Middle Class  170.160167   95.531053   8.194501  18887.120561
..      ...             ...         ...         ...        ...           ...
494  Female            Poor  119.231952  113.363784  57.312663  13448.948926
496  Female            Poor  187.528037   82.404516  18.529947  22187.561070
497  Female    Middle Class  178.123925   86.843404  40.600850  20907.746694
498  Female            Poor  179.871374   72.779608  38.477364  23164.137941
499  Female    Middle Class  143.008219   45.425839  40.433941  11414.287674

[254 rows x 6 columns]

In [14]:
double_group = data.groupby(["Gender","Economic Status"])

In [16]:
len(double_group)

6

In [17]:
for names, groups in double_group:
    print(names)
    print(groups)

('Female', 'Middle Class')
     Gender Economic Status      Height     Weight        Age        Income
1    Female    Middle Class  197.562254  77.290039  52.582434  21277.683092
7    Female    Middle Class  163.907926  62.567780  39.643636  17031.478808
12   Female    Middle Class  145.003603  85.634519 -10.617174  20183.243171
14   Female    Middle Class  170.160167  95.531053   8.194501  18887.120561
21   Female    Middle Class  166.403749  62.345164  18.201873  21030.027307
..      ...             ...         ...        ...        ...           ...
478  Female    Middle Class  164.083950  64.101798  43.310966  19734.886618
490  Female    Middle Class  173.995570  64.192538  27.277418  20029.218271
492  Female    Middle Class  173.180930  41.071367  39.660323  17529.114811
497  Female    Middle Class  178.123925  86.843404  40.600850  20907.746694
499  Female    Middle Class  143.008219  45.425839  40.433941  11414.287674

[97 rows x 6 columns]
('Female', 'Poor')
     Gender Economic Status      Height      Weight        Age        Income
19   Female            Poor  101.821158   51.910202  37.700344  16701.038986
20   Female            Poor  151.590550   31.051833  51.638326  20427.105749
27   Female            Poor  139.779020   14.191032  23.627726  14386.303978
33   Female            Poor  213.410251   70.463727  38.104672  19368.909589
36   Female            Poor  185.895203   86.758826  47.919127  21679.679649
..      ...             ...         ...         ...        ...           ...
484  Female            Poor  190.522885   60.827006  37.360131   6231.585805
489  Female            Poor  164.574654   41.054444  15.586792  22433.491858
494  Female            Poor  119.231952  113.363784  57.312663  13448.948926
496  Female            Poor  187.528037   82.404516  18.529947  22187.561070
498  Female            Poor  179.871374   72.779608  38.477364  23164.137941

[78 rows x 6 columns]
('Female', 'Rich')
     Gender Economic Status      Height     Weight        Age        Income
5    Female            Rich  167.512011  48.817092  45.698347  19918.387697
16   Female            Rich  204.647900  96.415109  38.456246  22701.461212
17   Female            Rich  146.525495  63.458661  16.177801  15020.534299
23   Female            Rich  187.245024  21.932640  36.635963  19771.564719
38   Female            Rich  203.008826  61.625486  30.607203  18494.535409
..      ...             ...         ...        ...        ...           ...
457  Female            Rich  107.685971  79.611946  38.971281  20529.100619
463  Female            Rich  206.311199  14.590616  37.479655  21830.015384
467  Female            Rich  178.304647  53.144591  44.862825  20762.117296
479  Female            Rich  130.275391  64.232067  27.140140  19181.359664
486  Female            Rich  182.009445  25.806820  20.989333  18295.843847

[79 rows x 6 columns]
('Male', 'Middle Class')
    Gender Economic Status      Height      Weight        Age        Income
0     Male    Middle Class  117.781557   97.834272  14.938084  17920.280966
2     Male    Middle Class  169.318207   92.244197  27.625656  15468.020544
4     Male    Middle Class  222.186635  119.904162  10.787840  18540.679655
9     Male    Middle Class  161.346168   74.265962  25.599495  15393.446640
15    Male    Middle Class  137.977882   89.608548  22.759301  18240.523385
..     ...             ...         ...         ...        ...           ...
483   Male    Middle Class  157.588418   42.837359  41.671686  16586.477389
485   Male    Middle Class  109.982765   97.183519  17.863850  20088.237911
487   Male    Middle Class  249.322550   61.017801  48.591057  12351.917534
491   Male    Middle Class  107.979852   73.205669  30.613716  21225.673953
495   Male    Middle Class  152.610146   85.586056  46.525653  21819.493822

[90 rows x 6 columns]
('Male', 'Poor')
    Gender Economic Status      Height      Weight        Age        Income
8     Male            Poor  167.877983   56.204792  14.285256  14353.086477
13    Male            Poor  122.737528  124.567823  28.387234  24913.122022
28    Male            Poor  182.135043   78.072955  31.523963  19825.734190
29    Male            Poor  179.576898   89.428514  37.083888  17998.625350
37    Male            Poor  167.306607   71.819954  35.676249  15436.892629
..     ...             ...         ...         ...        ...           ...
460   Male            Poor  185.545647   86.671516  28.655469  18633.842358
461   Male            Poor  175.651815   40.920137  37.062296  18885.129060
462   Male            Poor  168.008963   95.907913  22.812448  15484.162241
465   Male            Poor  141.115630   21.313598  27.472558  20345.118536
471   Male            Poor  174.411053   90.589995  52.347500  18928.195337

[78 rows x 6 columns]
('Male', 'Rich')
    Gender Economic Status      Height     Weight        Age        Income
3     Male            Rich  153.592959  70.243792  41.525063  16939.898258
6     Male            Rich  122.433934  96.429349  38.456869  12483.297406
10    Male            Rich  170.424785  72.236175  26.510484  12169.129764
11    Male            Rich  190.139455  81.355250  27.307995  16169.649061
22    Male            Rich  213.721659  95.288435  28.898199  15221.982898
..     ...             ...         ...        ...        ...           ...
455   Male            Rich  143.081947  68.039569  20.152553  23080.869687
456   Male            Rich  114.712685  74.968991  26.083495  22245.529545
458   Male            Rich  137.700471  19.006836  42.784360  16506.048706
488   Male            Rich  177.819679  73.980196  40.817707  19350.811621
493   Male            Rich  177.399772  80.431485  24.696225  20755.318312

[78 rows x 6 columns]

## Operaciones sobre datos agrupados

In [18]:
double_group.sum()

                              Height       Weight          Age        Income
Gender Economic Status
Female Middle Class     15550.428423  6592.144470  3075.963912  1.759266e+06
       Poor             12779.222750  5139.052411  2502.247794  1.364277e+06
       Rich             12596.454537  4988.760558  2228.886811  1.465847e+06
Male   Middle Class     14593.809829  5929.967389  2676.415519  1.604150e+06
       Poor             12579.158576  5285.330768  2500.292034  1.415310e+06
       Rich             12285.737631  4923.566421  2317.624821  1.378903e+06

In [19]:
double_group.mean()

                            Height     Weight        Age        Income
Gender Economic Status
Female Middle Class     160.313695  67.960252  31.710968  18136.764604
       Poor             163.836189  65.885287  32.080100  17490.734696
       Rich             159.448792  63.148868  28.213757  18555.031176
Male   Middle Class     162.153443  65.888527  29.737950  17823.885031
       Poor             161.271264  67.760651  32.055026  18145.005377
       Rich             157.509457  63.122646  29.713139  17678.238250

In [20]:
double_group.size()

Gender  Economic Status
Female  Middle Class       97
        Poor               78
        Rich               79
Male    Middle Class       90
        Poor               78
        Rich               78
dtype: int64

In [21]:
double_group.describe()

                       Height                                                 \
                        count        mean        std         min         25%
Gender Economic Status
Female Middle Class      97.0  160.313695  25.956750   85.745193  146.434268
       Poor              78.0  163.836189  32.013639  101.821158  140.433935
       Rich              79.0  159.448792  34.310398   64.923858  139.634285
Male   Middle Class      90.0  162.153443  33.588015   94.118289  139.970463
       Poor              78.0  161.271264  30.358819   73.810729  142.017737
       Rich              78.0  157.509457  32.449338   75.518593  133.734464

                                                           Weight             \
                               50%         75%         max  count       mean
Gender Economic Status
Female Middle Class     160.625926  174.714124  231.704634   97.0  67.960252
       Poor             163.764663  182.662308  242.169684   78.0  65.885287
       Rich             160.980358  182.338420  239.398762   79.0  63.148868
Male   Middle Class     161.678299  187.130300  249.322550   90.0  65.888527
       Poor             163.919197  180.705409  246.486069   78.0  67.760651
       Rich             159.978552  179.437431  216.536516   78.0  63.122646

                        ...        Age            Income                \
                        ...        75%        max  count          mean
Gender Economic Status  ...
Female Middle Class     ...  41.147524  63.406330   97.0  18136.764604
       Poor             ...  38.972874  65.087106   78.0  17490.734696
       Rich             ...  36.495076  55.003883   79.0  18555.031176
Male   Middle Class     ...  37.720629  56.928013   90.0  17823.885031
       Poor             ...  38.907165  62.245395   78.0  18145.005377
       Rich             ...  40.370752  62.547546   78.0  17678.238250

                                                                               \
                                std           min           25%           50%
Gender Economic Status
Female Middle Class     3492.374896   9913.314147  15905.637646  18115.014906
       Poor             3846.931373   6231.585805  14747.325667  17290.541672
       Rich             3481.600615  10577.940570  16307.640867  18553.490794
Male   Middle Class     2881.366954   8448.719961  16305.401138  17947.721941
       Poor             3644.317953  10947.627789  15035.657228  17945.628696
       Rich             3351.464180  10254.175806  14879.974013  17411.470630


                                 75%           max
Gender Economic Status
Female Middle Class     20305.923396  25973.373233
       Poor             20500.003176  24880.488999
       Rich             20804.769368  26077.296551
Male   Middle Class     19534.763943  27370.589105
       Poor             20647.736381  28081.312795
       Rich             20552.968179  24618.954783

[6 rows x 32 columns]

In [22]:
grouped_income = double_group["Income"]

In [23]:
grouped_income.describe()

                        count          mean          std           min  \
Gender Economic Status
Female Middle Class      97.0  18136.764604  3492.374896   9913.314147
       Poor              78.0  17490.734696  3846.931373   6231.585805
       Rich              79.0  18555.031176  3481.600615  10577.940570
Male   Middle Class      90.0  17823.885031  2881.366954   8448.719961
       Poor              78.0  18145.005377  3644.317953  10947.627789
       Rich              78.0  17678.238250  3351.464180  10254.175806

                                 25%           50%           75%           max
Gender Economic Status
Female Middle Class     15905.637646  18115.014906  20305.923396  25973.373233
       Poor             14747.325667  17290.541672  20500.003176  24880.488999
       Rich             16307.640867  18553.490794  20804.769368  26077.296551
Male   Middle Class     16305.401138  17947.721941  19534.763943  27370.589105
       Poor             15035.657228  17945.628696  20647.736381  28081.312795
       Rich             14879.974013  17411.470630  20552.968179  24618.954783

In [25]:
double_group.aggregate(
    {
        "Income": np.sum,
        "Age": np.mean,
        "Height": np.std
    }
)

                              Income        Age     Height
Gender Economic Status
Female Middle Class     1.759266e+06  31.710968  25.956750
       Poor             1.364277e+06  32.080100  32.013639
       Rich             1.465847e+06  28.213757  34.310398
Male   Middle Class     1.604150e+06  29.737950  33.588015
       Poor             1.415310e+06  32.055026  30.358819
       Rich             1.378903e+06  29.713139  32.449338

In [26]:
double_group.aggregate(
    {
        "Age": np.mean,
        "Height": lambda h:np.mean(h)/np.std(h)
    }
)

                              Age    Height
Gender Economic Status
Female Middle Class     31.710968  6.208270
       Poor             32.080100  5.150824
       Rich             28.213757  4.676939
Male   Middle Class     29.737950  4.854764
       Poor             32.055026  5.346555
       Rich             29.713139  4.885429

In [28]:
double_group.aggregate([np.sum,np.mean,np.std])

                              Height                              Weight  \
                                 sum        mean        std          sum
Gender Economic Status
Female Middle Class     15550.428423  160.313695  25.956750  6592.144470
       Poor             12779.222750  163.836189  32.013639  5139.052411
       Rich             12596.454537  159.448792  34.310398  4988.760558
Male   Middle Class     14593.809829  162.153443  33.588015  5929.967389
       Poor             12579.158576  161.271264  30.358819  5285.330768
       Rich             12285.737631  157.509457  32.449338  4923.566421

                                                      Age             \
                             mean        std          sum       mean
Gender Economic Status
Female Middle Class     67.960252  26.289924  3075.963912  31.710968
       Poor             65.885287  24.167971  2502.247794  32.080100
       Rich             63.148868  27.857528  2228.886811  28.213757
Male   Middle Class     65.888527  23.514172  2676.415519  29.737950
       Poor             67.760651  19.997313  2500.292034  32.055026
       Rich             63.122646  23.873697  2317.624821  29.713139

                                         Income
                              std           sum          mean          std
Gender Economic Status
Female Middle Class     12.392995  1.759266e+06  18136.764604  3492.374896
       Poor             12.615584  1.364277e+06  17490.734696  3846.931373
       Rich             11.037465  1.465847e+06  18555.031176  3481.600615
Male   Middle Class     12.020832  1.604150e+06  17823.885031  2881.366954
       Poor             10.846491  1.415310e+06  18145.005377  3644.317953
       Rich             12.845652  1.378903e+06  17678.238250  3351.464180

In [ ]:
double_group.aggregate